Revit 2027 API
FabricationPart.SpoolName Property
 The spool name of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string SpoolName { get; set; }
Public Property SpoolName As String
	Get
	Set
public:
property String^ SpoolName {
	String^ get ();
	void set (String^ value);
}
member SpoolName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
InvalidOperationException |  When setting this property:
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace